
Функция ПроверитьСоединение()
	
    Возврат "fast8.ru";
	
КонецФункции // ПроверитьСоединение()

Функция ПолучитьГлавныйУзелОбмена()
			
	Возврат fast8ОбменСервера.ПолучитьГлавныйУзелОбмена();
	
КонецФункции // ПолучитьГлавныйУзелОбмена()

Функция ЗарегистрироватьВсеИзменения(ИмяУстройства)
	
	Возврат fast8ОбменСервера.ЗарегистрироватьВсеИзменения(ИмяУстройства);
	
КонецФункции // ЗарегистрироватьВсеИзменения()

Функция ПолучитьОбъектБазы(ИмяУстройства, ИмяТаблицы)

	Возврат fast8ОбменСервера.ПолучитьОбъектБазы(ИмяУстройства, ИмяТаблицы);

КонецФункции // ПолучитьОбъектБазы()

Функция ПодтвердитьПолучениеОбъекта(ИмяУстройства, ДанныеСсылки, ТипДанных)
	
	Возврат fast8ОбменСервера.ПодтвердитьПолучениеОбъекта(ИмяУстройства, ДанныеСсылки, ТипДанных);
		
КонецФункции // ПодтвердитьПолучениеОбъекта()

Функция ПроверитьНаличиеИзменений(ИмяУстройства)
	
    Возврат fast8ОбменСервера.ПроверитьНаличиеИзменений(ИмяУстройства);
	
КонецФункции // ПроверитьНаличиеИзменений()

Функция ЗагрузитьОбъектБазы(ИмяУстройства, ДанныеОбъекта, ТипДанных)
	
    Возврат fast8ОбменСервера.ЗагрузитьОбъектБазы(ИмяУстройства, ДанныеОбъекта, ТипДанных);
	
КонецФункции // ЗагрузитьОбъектБазы()

Функция ПолучитьВерсиюПриложения()
	
	Возврат fast8ОбменСервера.ПолучитьВерсиюПриложения();

КонецФункции // ПолучитьВерсиюПриложения()

Функция ПолучитьВремяСервера()
	
	Возврат fast8ОбменСервера.ПолучитьВремяСервера();

КонецФункции // ПолучитьВерсиюПриложения()

Функция ПолучитьПрефикс(ИмяУстройства)
	
	Возврат fast8ОбменСервера.ПолучитьПрефикс(ИмяУстройства);

КонецФункции // ПолучитьПрефикс()

Функция ЗапуститьРасчетСписковПоСтатусу(ИмяУстройства, ДанныеОбъекта)
	
	Возврат fast8ОбменСервера.ЗапуститьРасчетСписковПоСтатусу(ИмяУстройства, ДанныеОбъекта);
	
КонецФункции // ЗапуститьРасчетСписковПоСтатусу()

Функция ПроверитьКоличествоИзменений(ИмяУстройства)
	
	Возврат fast8ОбменСервера.ПолучитьКоличествоИзменений(ИмяУстройства);
	
КонецФункции // ПроверитьКоличествоИзменений()
