&НаКлиенте
Процедура ЗарегистрироватьВсе(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	ЗарегистрироватьВсеНаСервере(ТекущиеДанные);
	
КонецПроцедуры // ЗарегистрироватьВсе()

&НаКлиенте
Процедура СнятьСРегистрацииВсе(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	СнятьСРегистрацииВсеНаСервере(ТекущиеДанные);
	
КонецПроцедуры // СнятьСРегистрацииВсе()

&НаСервере
Процедура ЗарегистрироватьВсеНаСервере(ТекущиеДанные)
	
	Если ТекущиеДанные <> Неопределено И ТекущиеДанные.Ссылка <> ПланыОбмена.fast8Полный.ЭтотУзел() Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры // ЗарегистрироватьВсеНаСервере()

&НаСервере
Процедура СнятьСРегистрацииВсеНаСервере(ТекущиеДанные)

	Если ТекущиеДанные <> Неопределено И ТекущиеДанные.Ссылка <> ПланыОбмена.fast8Полный.ЭтотУзел() Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры // СнятьСРегистрацииВсеНаСервере()
