//MIT License
//
//Copyright (c) 2023 FAST8.RU
//
//Permission is hereby granted, free of charge, to any person obtaining a copy
//of this software and associated documentation files (the "Software"), to deal
//in the Software without restriction, including without limitation the rights
//to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
//copies of the Software, and to permit persons to whom the Software is
//furnished to do so, subject to the following conditions:
//
//The above copyright notice and this permission notice shall be included in all
//copies or substantial portions of the Software.
//
//THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
//IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
//FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
//AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
//LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
//OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
//SOFTWARE.


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВремяАвтовыключения = Константы.fast8ВремяАвтовыключения.Получить();
	ПользовательУстройства = Константы.fast8ПользовательУстройства.Получить();
	ПодключениеКСерверу = Константы.fast8ПодключениеКСерверу.Получить();
	КодЭтогоУзла = ПараметрыСеанса.fast8Префикс;
	ЗаголовокСообщенияТелеграм = Константы.fast8ЗаголовокСообщенияТелеграм.Получить();
	ИмяГруппыТелеграм = Константы.fast8ИмяГруппыТелеграм.Получить();
	
	Если ЗначениеЗаполнено(ПользовательУстройства) Тогда
		Элементы.ПользовательУстройства.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	#Если МобильноеПриложениеСервер Тогда
	Элементы.ЗаголовокСообщенияТелеграм.Видимость = Ложь;
	Элементы.ИмяГруппыТелеграм.Видимость = Ложь;
	#Иначе
	Элементы.ПодключениеКСерверу.Видимость = Ложь;
	Элементы.ПользовательУстройства.Видимость = Ложь;
	Элементы.ПарольПодключения.Видимость = Ложь;
	Элементы.ВремяАвтовыключения.Видимость = Ложь;
	Элементы.ПроверитьСоединение.Видимость = Ложь;
	Элементы.ВремяСервера.Видимость = Ложь;
	Элементы.ЗагрузитьНачальныеДанные.Видимость = Ложь;
	#КонецЕсли

КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ВремяАвтовыключенияПриИзменении(Элемент)
	
	ВремяАвтовыключенияПриИзмененииНаСервере();
	
КонецПроцедуры // ВремяАвтовыключенияПриИзменении()

&НаСервере
Процедура ВремяАвтовыключенияПриИзмененииНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	Константы.fast8ВремяАвтовыключения.Установить(ВремяАвтовыключения);

КонецПроцедуры // ВремяАвтовыключенияПриИзмененииНаСервере()

&НаКлиенте
Процедура ПодключениеКСерверуПриИзменении(Элемент)
	
	ПодключениеКСерверуПриИзмененииНаСервере();
	
КонецПроцедуры // ПодключениеКСерверуПриИзменении()

&НаСервере
Процедура ПодключениеКСерверуПриИзмененииНаСервере()

	УстановитьПривилегированныйРежим(Истина);
	Константы.fast8ПодключениеКСерверу.Установить(ПодключениеКСерверу);

КонецПроцедуры // ПодключениеКСерверуПриИзмененииНаСервере()

&НаКлиенте
Процедура ПользовательУстройстваПриИзменении(Элемент)
	
	ОбновитьПользователя();
	
КонецПроцедуры // ПользовательУстройстваПриИзменении()

&НаСервере
Процедура ОбновитьПользователя()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПользовательУстройства	<> Константы.fast8ПользовательУстройства.Получить() Тогда
		Константы.fast8ПользовательУстройства.Установить(ПользовательУстройства);
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(ПользовательУстройства) Тогда
		Возврат;
	КонецЕсли;
	
	fast8Пользователи.ОбновитьПользователяУстройства();
		
КонецПроцедуры // ОбновитьПользователя()

&НаКлиенте
Процедура ПроверитьСоединение(Команда)
	
    Если ПроверитьСоединениеСервер() = Истина Тогда
		ПоказатьОповещениеПользователя("Связь установлена.");
	КонецЕсли;
	
КонецПроцедуры // ПроверитьСоединение()

&НаСервере
Функция ПроверитьСоединениеСервер()

	ВебСервис = fast8ОбменКлиента.ПолучитьПодключение();
	ВремяСервера = fast8ОбменКлиента.ПолучитьВремяСервера(ВебСервис);
	
	Возврат fast8ОбменКлиента.ПроверитьСвязь(ВебСервис);
	
КонецФункции // ПроверитьСоединениеСервер()

&НаКлиенте
Процедура ЗагрузитьНачальныеДанные(Команда)
	
	ЗагрузитьНачальныеДанныеНаСервере();
	ОписаниеОЗакрытии = Новый ОписаниеОповещения("ОбменДаннымиЗавершен", ЭтаФорма);		
	ОткрытьФорму("ОбщаяФорма.fast8ПрогрессОбмена",, ЭтаФорма,,,, ОписаниеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры // ЗагрузитьНачальныеДанные()

&НаСервере
Процедура ЗагрузитьНачальныеДанныеНаСервере()

	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	fast8Пользователи.ОбработатьСлужебногоПользователя();
	
	ВебСервис = fast8ОбменКлиента.ПолучитьПодключение();
	fast8ОбменКлиента.ПолучитьГлавныйУзелОбмена(ВебСервис);
	fast8ОбменКлиента.ПолучитьПрефикс(ВебСервис);
	fast8ОбменКлиента.ЗарегистрироватьВсе(ВебСервис);
	ВебСервис = Неопределено;
	
КонецПроцедуры // ЗагрузитьНачальныеДанныеНаСервере()

&НаКлиенте
Процедура ОбменДаннымиЗавершен(Параметр1, Параметр2) Экспорт

	ЗавершитьРаботуСистемы();
	
КонецПроцедуры // ОбменДаннымиЗавершен()

&НаСервере
Процедура ПарольПодключенияПриИзмененииНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	Константы.fast8ПарольПодключения.Установить(ПарольПодключения);
	
КонецПроцедуры // ПарольПодключенияПриИзмененииНаСервере()

&НаКлиенте
Процедура ПарольПодключенияПриИзменении(Элемент)
	
	ПарольПодключенияПриИзмененииНаСервере();
	
КонецПроцедуры // ПарольПодключенияПриИзменении()

&НаСервере
Процедура ЗаголовокСообщенияТелеграмПриИзмененииНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	Константы.fast8ЗаголовокСообщенияТелеграм.Установить(ЗаголовокСообщенияТелеграм);
	
КонецПроцедуры // ЗаголовокСообщенияТелеграмПриИзмененииНаСервере()

&НаКлиенте
Процедура ЗаголовокСообщенияТелеграмПриИзменении(Элемент)
	
	ЗаголовокСообщенияТелеграмПриИзмененииНаСервере();
	
КонецПроцедуры // ЗаголовокСообщенияТелеграмПриИзменении()

&НаКлиенте
Процедура ИмяГруппыТелеграмПриИзменении(Элемент)
	
	ИмяГруппыТелеграмПриИзмененииНаСервере();
	
КонецПроцедуры // ИмяГруппыТелеграмПриИзменении()

&НаСервере
Процедура ИмяГруппыТелеграмПриИзмененииНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	Константы.fast8ИмяГруппыТелеграм.Установить(ИмяГруппыТелеграм);
	
КонецПроцедуры // ИмяГруппыТелеграмПриИзмененииНаСервере()
