Перем глВерсияСервераОтличается Экспорт;
Перем глСвязьУстановлена Экспорт;
Перем глВыполняетсяОбмен Экспорт;

Процедура ПриНачалеРаботыСистемы()
	
	#Если МобильноеПриложениеКлиент Тогда
	Если Не fast8Пользователи.ПроверитьПользователяУстройства() Тогда
		ОткрытьФорму("ОбщаяФорма.fast8Настройки");
	КонецЕсли;		
	#Иначе
	fast8Пользователи.ПроверитьПользователей();
	#КонецЕсли
	
	Если глСвязьУстановлена = Истина И глВерсияСервераОтличается = Истина Или глСвязьУстановлена = Ложь Тогда
		ЗавершитьРаботуСистемы();
	КонецЕсли;
	
КонецПроцедуры // ПриНачалеРаботыСистемы()
