
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	Если ТребуемыеПараметры <> Неопределено Тогда
		Для Каждого Параметр Из ТребуемыеПараметры Цикл
			Если Параметр = "fast8ТекущийПользователь" Тогда
				Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
				Если ЗначениеЗаполнено(Пользователь) Тогда
					ТекущийПользователь = Справочники.fast8Пользователи.НайтиПоНаименованию(Пользователь);
				Иначе
					ТекущийПользователь = Справочники.fast8Пользователи.Сервер;
				КонецЕсли;
				ПараметрыСеанса.fast8ТекущийПользователь = ТекущийПользователь;
			КонецЕсли;
			Если Параметр = "fast8ДельтаВремениССервером" Тогда
				ПараметрыСеанса.fast8ДельтаВремениССервером = 0;
			КонецЕсли;
			Если Параметр = "fast8Префикс" Тогда
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	fast8Полный.Код
				|ИЗ
				|	ПланОбмена.fast8Полный КАК fast8Полный
				|ГДЕ
				|	fast8Полный.ЭтотУзел";
				Выборка = Запрос.Выполнить().Выбрать();
				Выборка.Следующий();
				ПараметрыСеанса.fast8Префикс = Выборка.Код;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // УстановкаПараметровСеанса()
