//MIT License
//
//Copyright (c) 2023 FAST8.RU
//
//Permission is hereby granted, free of charge, to any person obtaining a copy
//of this software and associated documentation files (the "Software"), to deal
//in the Software without restriction, including without limitation the rights
//to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
//copies of the Software, and to permit persons to whom the Software is
//furnished to do so, subject to the following conditions:
//
//The above copyright notice and this permission notice shall be included in all
//copies or substantial portions of the Software.
//
//THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
//IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
//FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
//AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
//LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
//OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
//SOFTWARE.


Процедура СформироватьЗаписиСписковЗаданий(Задание) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	fast8ИсторияВыполненияЗаданийСрезПоследних.Процесс КАК Процесс,
	|	fast8ИсторияВыполненияЗаданийСрезПоследних.Задание КАК Задание,
	|	fast8ИсторияВыполненияЗаданийСрезПоследних.Статус КАК Статус,
	|	fast8ИсторияВыполненияЗаданийСрезПоследних.Исполнитель КАК Исполнитель
	|ПОМЕСТИТЬ ВТ_ТекущийСтатус
	|ИЗ
	|	РегистрСведений.fast8ИсторияВыполненияЗаданий.СрезПоследних(, Задание = &Задание) КАК fast8ИсторияВыполненияЗаданийСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""На исполнении"" КАК ИмяТаблицы,
	|	ВТ_ТекущийСтатус.Процесс КАК Процесс,
	|	ВТ_ТекущийСтатус.Задание КАК Задание,
	|	ВТ_ТекущийСтатус.Задание.Дата КАК Дата,
	|	fast8ПроцессыУчастники.Пользователь КАК Пользователь,
	|	ВТ_ТекущийСтатус.Статус КАК Статус,
	|	ВТ_ТекущийСтатус.Исполнитель КАК Исполнитель
	|ИЗ
	|	ВТ_ТекущийСтатус КАК ВТ_ТекущийСтатус
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.fast8Процессы.Участники КАК fast8ПроцессыУчастники
	|		ПО ВТ_ТекущийСтатус.Процесс = fast8ПроцессыУчастники.Ссылка
	|			И (ВТ_ТекущийСтатус.Статус = ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.Новое))
	|			И (fast8ПроцессыУчастники.Исполнение)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""На исполнении"",
	|	ВТ_ТекущийСтатус.Процесс,
	|	ВТ_ТекущийСтатус.Задание,
	|	ВТ_ТекущийСтатус.Задание.Дата,
	|	ВТ_ТекущийСтатус.Исполнитель,
	|	ВТ_ТекущийСтатус.Статус,
	|	ВТ_ТекущийСтатус.Исполнитель
	|ИЗ
	|	ВТ_ТекущийСтатус КАК ВТ_ТекущийСтатус
	|ГДЕ
	|	ВТ_ТекущийСтатус.Статус В (ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.НазначенИсполнитель), ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.ПереданоВРаботу), ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.Выполняется), ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.ВозвращеноНаДоработку))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""На назначении"" КАК ИмяТаблицы,
	|	ВТ_ТекущийСтатус.Процесс КАК Процесс,
	|	ВТ_ТекущийСтатус.Задание КАК Задание,
	|	ВТ_ТекущийСтатус.Задание.Дата КАК Дата,
	|	fast8ПроцессыУчастники.Пользователь КАК Пользователь,
	|	ВТ_ТекущийСтатус.Статус КАК Статус,
	|	ВТ_ТекущийСтатус.Исполнитель КАК Исполнитель
	|ИЗ
	|	ВТ_ТекущийСтатус КАК ВТ_ТекущийСтатус
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.fast8Процессы.Участники КАК fast8ПроцессыУчастники
	|		ПО ВТ_ТекущийСтатус.Процесс = fast8ПроцессыУчастники.Ссылка
	|			И (ВТ_ТекущийСтатус.Статус = ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.Новое))
	|			И (fast8ПроцессыУчастники.Управление)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""На контроле"" КАК ИмяТаблицы,
	|	ВТ_ТекущийСтатус.Процесс КАК Процесс,
	|	ВТ_ТекущийСтатус.Задание КАК Задание,
	|	ВТ_ТекущийСтатус.Задание.Дата КАК Дата,
	|	fast8ПроцессыУчастники.Пользователь КАК Пользователь,
	|	ВТ_ТекущийСтатус.Статус КАК Статус,
	|	ВТ_ТекущийСтатус.Исполнитель КАК Исполнитель
	|ИЗ
	|	ВТ_ТекущийСтатус КАК ВТ_ТекущийСтатус
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.fast8Процессы.Участники КАК fast8ПроцессыУчастники
	|		ПО ВТ_ТекущийСтатус.Процесс = fast8ПроцессыУчастники.Ссылка
	|			И (fast8ПроцессыУчастники.Управление)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.fast8Процессы.Участники КАК fast8ПроцессыУчастникиПроверка
	|		ПО ВТ_ТекущийСтатус.Процесс = fast8ПроцессыУчастникиПроверка.Ссылка
	|			И ВТ_ТекущийСтатус.Исполнитель = fast8ПроцессыУчастникиПроверка.Пользователь
	|			И (fast8ПроцессыУчастникиПроверка.ТребуетсяКонтроль)
	|ГДЕ
	|	ВТ_ТекущийСтатус.Статус В (ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.Новое), ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.НазначенИсполнитель), ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.ПереданоВРаботу), ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.Выполняется), ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.ВозвращеноНаДоработку))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""На проверке"" КАК ИмяТаблицы,
	|	ВТ_ТекущийСтатус.Процесс КАК Процесс,
	|	ВТ_ТекущийСтатус.Задание КАК Задание,
	|	ВТ_ТекущийСтатус.Задание.Дата КАК Дата,
	|	fast8ПроцессыУчастники.Пользователь КАК Пользователь,
	|	ВТ_ТекущийСтатус.Статус КАК Статус,
	|	ВТ_ТекущийСтатус.Исполнитель КАК Исполнитель
	|ИЗ
	|	ВТ_ТекущийСтатус КАК ВТ_ТекущийСтатус
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.fast8Процессы.Участники КАК fast8ПроцессыУчастники
	|		ПО ВТ_ТекущийСтатус.Процесс = fast8ПроцессыУчастники.Ссылка
	|			И (ВТ_ТекущийСтатус.Статус = ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.НаПроверке))
	|			И (fast8ПроцессыУчастники.Контроль)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""На просмотре"" КАК ИмяТаблицы,
	|	ВТ_ТекущийСтатус.Процесс КАК Процесс,
	|	ВТ_ТекущийСтатус.Задание КАК Задание,
	|	ВТ_ТекущийСтатус.Задание.Дата КАК Дата,
	|	fast8ПроцессыУчастники.Пользователь КАК Пользователь,
	|	ВТ_ТекущийСтатус.Статус КАК Статус,
	|	ВТ_ТекущийСтатус.Исполнитель КАК Исполнитель
	|ИЗ
	|	ВТ_ТекущийСтатус КАК ВТ_ТекущийСтатус
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.fast8Процессы.Участники КАК fast8ПроцессыУчастники
	|		ПО ВТ_ТекущийСтатус.Процесс = fast8ПроцессыУчастники.Ссылка
	|			И (ВТ_ТекущийСтатус.Статус В (ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.Новое), ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.НазначенИсполнитель), ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.ПереданоВРаботу), ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.Выполняется), ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.ВозвращеноНаДоработку)))
	|			И (fast8ПроцессыУчастники.ТолькоПросмотр)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Мои на проверке"" КАК ИмяТаблицы,
	|	ВТ_ТекущийСтатус.Процесс КАК Процесс,
	|	ВТ_ТекущийСтатус.Задание КАК Задание,
	|	ВТ_ТекущийСтатус.Задание.Дата КАК Дата,
	|	ВТ_ТекущийСтатус.Исполнитель КАК Пользователь,
	|	ВТ_ТекущийСтатус.Статус КАК Статус,
	|	ВТ_ТекущийСтатус.Исполнитель КАК Исполнитель
	|ИЗ
	|	ВТ_ТекущийСтатус КАК ВТ_ТекущийСтатус
	|ГДЕ
	|	ВТ_ТекущийСтатус.Статус = ЗНАЧЕНИЕ(Перечисление.fast8СтатусыЗаданий.НаПроверке)";
	Запрос.УстановитьПараметр("Задание", Задание);
	
	Результат = Запрос.ВыполнитьПакет();
	
	РегистрыСтатусов = Новый Соответствие;
	РегистрыСтатусов.Вставить(1, "fast8ЗадачиНаИсполнении");
	РегистрыСтатусов.Вставить(2, "fast8ЗадачиНаНазначении");
	РегистрыСтатусов.Вставить(3, "fast8ЗадачиНаКонтроле");
	РегистрыСтатусов.Вставить(4, "fast8ЗадачиНаПроверке");
	РегистрыСтатусов.Вставить(5, "fast8ЗадачиНаПросмотре");
	РегистрыСтатусов.Вставить(6, "fast8ЗадачиМоиНаПроверке");
	
	Для Каждого РегистрСтатуса Из РегистрыСтатусов Цикл
		НаборЗаписей = РегистрыСведений[РегистрСтатуса.Значение].СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Задание);
		НаборЗаписей.Загрузить(Результат.Получить(РегистрСтатуса.Ключ).Выгрузить());
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры // СформироватьЗаписиСписковЗаданий()